# 1. Напишите программу, удаляющую из текста все слова, содержащие ""абв"".
text = input('Введите текст: ')
outputText = text.replace('абв', '')
print(outputText)